// 1629.cpp
// 곱셈
//
// 그냥 (A^B) % C를 구하는 문제
// A^B를 구할 때,
// A를 B개만큼 곱하는 것 (시간복잡도 : O(B) )이 아니라 B를 2진수로 나타내어 A, A^2, A^4, .... 값을 구하여 곱해나간다. ( O(logB) )
// 예를 들어 A^13을 구하는 방법은 A* ... *A (13개) = A^13이 아니라
// A^13 = A * A^4 * A^8 가 된다. 
// 위의 설명이 이해가 안가면 코드를 보고 이해해도 무방하다. (짧아서 보기 쉬움)
//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#include<iostream>

using namespace std;

int main() {

	long long A;
	int B, C;
	long long res = 1;
	cin >> A >> B >> C;
	while (B != 0) {
		if (B % 2 == 1) {
			res *= A;
			res %= C;
		}
		A = (A%C)*(A%C) % C;
		B = B >> 1;
	}
	cout << res << endl;
	return 0;
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////